# E	             6⁺,	        3⁺,	 2,	           3⁻,	            6⁻
((1,              1,             1,  1,             1,              1), # Γ1
 (1,  exp(4π*1im/3), exp(2π*1im/3),  1, exp(4π*1im/3),  exp(2π*1im/3)), # Γ2
 (1,  exp(2π*1im/3), exp(4π*1im/3),  1, exp(2π*1im/3),  exp(4π*1im/3)), # Γ3
 (1,             -1,             1, -1,             1,             -1), # Γ4
 (1, -exp(4π*1im/3), exp(2π*1im/3), -1, exp(4π*1im/3), -exp(2π*1im/3)), # Γ5
 (1, -exp(2π*1im/3), exp(4π*1im/3), -1, exp(2π*1im/3), -exp(4π*1im/3))) # Γ6 